In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [2]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                    'k2':['alpha','beta','alpha','beta','alpha'],
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5)})

dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.323534  1.681680
1  X   beta  0.805800 -0.326655
2  Y  alpha  0.463298  0.068401
3  Y   beta -0.738612  1.441916
4  Z  alpha -0.010504 -0.244040

In [3]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [4]:
group1

In [5]:
group1.mean()

k1
X    0.564667
Y   -0.137657
Z   -0.010504
Name: dataset1, dtype: float64

In [6]:
cities = np.array(['NY','LA','LA','NY','NY'])

month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [7]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB    0.805800
    JAN    0.463298
NY  FEB   -0.738612
    JAN    0.156515
Name: dataset1, dtype: float64

In [8]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.323534  1.681680
1  X   beta  0.805800 -0.326655
2  Y  alpha  0.463298  0.068401
3  Y   beta -0.738612  1.441916
4  Z  alpha -0.010504 -0.244040

In [9]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X   0.564667  0.677513
Y  -0.137657  0.755158
Z  -0.010504 -0.244040

In [10]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  0.323534  1.681680
   beta   0.805800 -0.326655
Y  alpha  0.463298  0.068401
   beta  -0.738612  1.441916
Z  alpha -0.010504 -0.244040

In [11]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [12]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.323534  1.681680
1  X   beta  0.805800 -0.326655
2  Y  alpha  0.463298  0.068401
3  Y   beta -0.738612  1.441916
4  Z  alpha -0.010504 -0.244040

In [13]:
for name, group in dframe.groupby('k1'):
    print(f"This is the {name} group")
    print(group)
    print('\n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha  0.323534  1.681680
1  X   beta  0.805800 -0.326655


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha  0.463298  0.068401
3  Y   beta -0.738612  1.441916


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha -0.010504  -0.24404

In [14]:
for (k1,k2), group in dframe.groupby(['k1','k2']):
    print(f"Key1 = {k1} Key2 {k2}")
    print(group)
    print('\n')

Key1 = X Key2 alpha
  k1     k2  dataset1  dataset2
0  X  alpha  0.323534   1.68168


Key1 = X Key2 beta
  k1    k2  dataset1  dataset2
1  X  beta    0.8058 -0.326655


Key1 = Y Key2 alpha
  k1     k2  dataset1  dataset2
2  Y  alpha  0.463298  0.068401


Key1 = Y Key2 beta
  k1    k2  dataset1  dataset2
3  Y  beta -0.738612  1.441916


Key1 = Z Key2 alpha
  k1     k2  dataset1  dataset2
4  Z  alpha -0.010504  -0.24404

In [15]:
group_dict = dict(list(dframe.groupby('k1')))

In [16]:
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha  0.323534  1.681680
1  X   beta  0.805800 -0.326655

In [17]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes, axis=1)))

In [18]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  0.323534  1.681680
 1  0.805800 -0.326655
 2  0.463298  0.068401
 3 -0.738612  1.441916
 4 -0.010504 -0.244040, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [20]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

dataset2_group.mean()

          dataset2
k1 k2
X  alpha  1.681680
   beta  -0.326655
Y  alpha  0.068401
   beta   1.441916
Z  alpha -0.244040